submission/HW05-PerformanceTesting/reports/Report_Spike/statistics.json
{
  "POST /api/checkout" : {
    "transaction" : "POST /api/checkout",
    "sampleCount" : 4950,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 49.1262626262626,
    "medianResTime" : 9.0,
    "minResTime" : 4.0,
    "maxResTime" : 2540.0,
    "pct1ResTime" : 21.0,
    "pct2ResTime" : 51.44999999999982,
    "pct3ResTime" : 1557.409999999998,
    "throughput" : 42.69854824935952,
    "receivedKBytesPerSec" : 13.134807322801025,
    "sentKBytesPerSec" : 17.17105337642005
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10234,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 53.8210865741647,
    "medianResTime" : 5.0,
    "minResTime" : 0.0,
    "maxResTime" : 2961.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 2075.4499999999953,
    "throughput" : 84.74099099099098,
    "receivedKBytesPerSec" : 25.013974689590786,
    "sentKBytesPerSec" : 33.288572601496256
  },
  "POST /api/cart" : {
    "transaction" : "POST /api/cart",
    "sampleCount" : 5083,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.5252803462522153,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 663.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.159999999999854,
    "throughput" : 43.06568724635471,
    "receivedKBytesPerSec" : 12.364562549246372,
    "sentKBytesPerSec" : 16.755267111260792
  },
  "POST /api/login (Setup Token)" : {
    "transaction" : "POST /api/login (Setup Token)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 132.0,
    "medianResTime" : 132.0,
    "minResTime" : 132.0,
    "maxResTime" : 132.0,
    "pct1ResTime" : 132.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 132.0,
    "throughput" : 7.575757575757576,
    "receivedKBytesPerSec" : 4.6978574810606055,
    "sentKBytesPerSec" : 1.6867897727272727
  },
  "Transaction: Add to Cart + Checkout" : {
    "transaction" : "Transaction: Add to Cart + Checkout",
    "sampleCount" : 5150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 106.9011650485437,
    "medianResTime" : 11.0,
    "minResTime" : 0.0,
    "maxResTime" : 2961.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 611.3499999999995,
    "pct3ResTime" : 2363.9799999999996,
    "throughput" : 42.91058766674721,
    "receivedKBytesPerSec" : 24.847163578909655,
    "sentKBytesPerSec" : 33.0639031866319
  }
}